{"_id":{"$oid":"66132a8b12f43b64bef025ce"},"Title":"Sleeping with Other People","Description":"Twelve years after a one-night stand, a man and a woman run into each other and try to maintain a platonic relationship despite their mutual attraction.","Genre":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters. Typically their journey through dating, courtship or marriage is featured."},"Director":{"Name":"Leslye Headland","Bio":"Leslye Headland is an American film and television dirctor, producer, and screenwriter.","Birth":"1980"},"ImagePath":"sleepingwithotherpeople.png","Featured":true}
{"_id":{"$oid":"66132fbe12f43b64bef025cf"},"Title":"LaLaLand","Description":"Sebastian and Mia are drawn together by their common desire to do what they love. But as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by dancing. The songs usually advance the plot or develop the film's characters, but in some cases, they serve merely as breaks in the storyline, often as elaborate production numbers."},"Director":{"Name":"Damien Chazelle","Bio":"Damien Chazelle is an American film screenwriter, producer, and director.","Birth":"1985"},"ImagePath":"lalaland.png","Featured":true}
{"_id":{"$oid":"6613509912f43b64bef025d0"},"Title":"Sleeping with Other People","Description":"Twelve years after a one-night stand, a man and a woman run into each other and try to maintain a platonic relationship despite their mutual attraction.","Genre":{"Name":"Romance","Description":"The romance genre is a storytelling genre that focuses on love and romantic relationships between two or more characters."},"Director":{"Name":"Leslye Headland","Bio":"Leslye Headland is an American screenwriter, producer, and film director.","Birth":"1980"},"ImagePath":"sleepingwithotherpeople.png","Featured":true}
{"_id":{"$oid":"6613524b12f43b64bef025d1"},"Title":"LaLaLand","Description":"Sebastian and Mia are drawn together by their common desire to do what they love. But as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by dancing. The songs usually advance the plot or develop the film's characters, but in some cases they serve merely as breaks in the storyline, often as elaborate production numbers."},"Director":{"Name":"Damien Chazelle","Bio":"Damien Chazelle is an American film screenwriter, producer, and director.","Birth":"1985"},"ImagePath":"lalaland.png","Featured":true}
{"_id":{"$oid":"661354d212f43b64bef025d2"},"Title":"The Perks of Being a Wallflower","Description":"Socially awkward teen Charlie, is a wallflower, always watching life from the sidelines, until two charismatic students become his mentors. Free spirited Sam and her stepbrother Patrick help Charlie discover the joys of friendship, love, music, and much more.","Genre":{"Name":"Drama","Description":"A category in film or television that is either semi-fictional or fictional narrative that is intended to be more serious than humorous in tone."},"Director":{"Name":"Stephen Chbosky","Bio":"Stephen Chbosky is an American film director, screenwriter, and author.","Birth":"1970"},"ImagePath":"perksofbeingwallflower.png","Featured":true}
{"_id":{"$oid":"661356d612f43b64bef025d3"},"Title":"No Hard Feelings","Description":"On the brink of losing her childhood home, a desperate woman agrees to date a wealthy couple's introverted and awkward 19-year-old son. However, he proves to be more of a challenge than she expected, and time is running out before she loses it all.","Genre":{"Name":"Comedy","Description":"A comedy film is a film genre that emphasizes humor. These films are designed to amuse audiences and make them laugh. Films in this genre typically have a happy ending, with dark comedy being an exception to this rule."},"Director":{"Name":"Gene Stupnitsky","Bio":"Gene Stupnitsky is a Ukranian-born American film and television writer, producer, and director.","Birth":"1977"},"ImagePath":"nohardfeelings.png","Featured":true}
{"_id":{"$oid":"6613596212f43b64bef025d4"},"Title":"Love, Rosie","Description":"Best friends Rosie and Alex are suddenly separated when Alex and his family move from Dublin to America. Can their friendship survive years and distance? Will they gamble everything for true love?","Genre":{"Name":"Romantic Comedy","Description":"Romantic Comedy is a subgenre of comedy and romance fiction, focusing on lighthearted, humorous plot lines centered on romantic ideas, such as how true love is able to surmount most obstacles."},"Director":{"Name":"Christian Ditter","Bio":"Christian Ditter is a German-born American film director, producer, and screenwriter.","Birth":"1977"},"ImagePath":"loverosie.png","Featured":true}
{"_id":{"$oid":"66135be612f43b64bef025d5"},"Title":"The Book of Eli","Description":"Thirty years after war turned the world into a wasteland, a lone warrior named Eli marches across the ruined landscape, carrying hope for humanity's redemption. Only one other man understands the power of what Eli carries, and he is determined to take it for himself. Though Eli prefers peace, he will risk death to protect his precious cargo, for he must fulfill his destiny to help restore mankind.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that evokes excitement and suspense in the audience."},"Director":{"Name":"Albert and Allen Hughes","Bio":"Albert and Allen Hughes, professionally known as the Hughes Brothers, are American film directors and producers.","Birth":"1972"},"ImagePath":"bookofeli.png","Featured":true}
{"_id":{"$oid":"66135e1612f43b64bef025d6"},"Title":"Nobody","Description":"Hutch Mansell fails to defend himself or his family when two thieves break into his suburban home one night. The aftermath of the incident soon strikes a match to his long-simmering rage. In a barrage of fists, gunfire and squealing tires, Hutch must now save his wife and son from a dangerous adversary -- and ensure that he will never be underestimated again.","Genre":{"Name":"Action","Description":"The action film is a film genre which predominantly features chase sequences, fights, shootouts, explosions, and stunt work."},"Director":{"Name":"Ilya Naishuller","Bio":"Ilya Naishuller is a Russian film director and musician. He is known for directing action films Hardcore Henry and Nobody.","Birth":"1983"},"ImagePath":"nobody.png","Featured":true}
{"_id":{"$oid":"66135fd212f43b64bef025d7"},"Title":"Your Place or Mine","Description":"Debbie and Peter are best friends and total opposites. She craves routine with her son in LA, but he thrives on change in NY. When they swap houses and lives for a week they discover what they think they want might not be what they really need.","Genre":{"Name":"Romance","Description":"The romance genre is a storytelling genre that focuses on love and romantic relationships between two or more characters."},"Director":{"Name":"Aline Brosh McKenna","Bio":"Aline Brosh McKenna is an American film producer, screenwriter, and director.","Birth":"1967"},"ImagePath":"yourplace.png","Featured":true}
{"_id":{"$oid":"661362ab12f43b64bef025d8"},"Title":"Little Women","Description":"In this 1994 adaptation of Louisa May Alcott's classic, the March sisters confront growing pains, financial shortages, family tragedies and romantic rivalries in mid-19th-century Massachusetts.","Genre":{"Name":"Drama","Description":"A category in film or television that is either semi-fictional or fictional narrative that is intended to be more serious than humorous in tone."},"Director":{"Name":"Gillian Armstrong","Bio":"Gillian May Armstrong is an Australian feature film and documentary director.","Birth":"1950"},"ImagePath":"littlewomen.png","Featured":true}
{"_id":{"$oid":"6613644e12f43b64bef025d9"},"Title":"American History X","Description":"Living a life marked by violence and racism, neo-Nazi Derek Vinyard finally goes to prison after killing two black youths who tried to steal his car. Upon his release, Derek vows to change his ways; he hopes to prevent his younger brother, Danny, who idolizes Derek, from following in his footsteps. As he struggles with his own deeply ingrained prejudices and watches their mother grow sicker, Derek wonders if his family can overcome a lifetime of hate.","Genre":{"Name":"Independent","Description":"Film production mostly or completely done outside of the major film studio system."},"Director":{"Name":"Tony Kaye","Bio":"Tony Kaye is an English director of films, music videos, advertisements, and documentaries.","Birth":"1952"},"ImagePath":"historyx.png","Featured":true}
{"_id":{"$oid":"661365fa12f43b64bef025da"},"Title":"How to Be Single","Description":"After four years of college, young Alice decides she needs a break from her long-term boyfriend Josh. Excited and ready for new challenges, the eager grad moves to New York to take a job as a paralegal. Helping her navigate her way through an unfamiliar city is Robin, a fun-loving, wild co-worker who enjoys partying and one-night stands. With Robin as her freewheeling guide, Alice can now learn how to get free drinks, meet men and enjoy the single lifestyle.","Genre":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters."},"Director":{"Name":"Christian Ditter","Bio":"Christian Ditter is a German-born American film director, producer, and screenwriter.","Birth":"1977"},"ImagePath":"single.png","Featured":true}
{"_id":{"$oid":"6613673c12f43b64bef025db"},"Title":"How to Be Single","Description":"After four years of college, young Alice decides she needs a break from her long-term boyfriend Josh. Excited and ready for new challenges, the eager grad moves to New York to take a job as a paralegal. Helping her navigate her way through an unfamiliar city is Robin, a fun-loving, wild co-worker who enjoys partying and one-night stands. With Robin as her freewheeling guide, Alice can now learn how to get free drinks, meet men and enjoy the single lifestyle.","Genre":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters."},"Director":{"Name":"Christian Ditter","Bio":"Christian Ditter is a German-born American film director, producer, and screenwriter.","Birth":"1977"},"ImagePath":"single.png","Featured":true}
{"_id":{"$oid":"661368ed12f43b64bef025dc"},"Title":"The Devil Wears Prada","Description":"Andy is a recent college graduate with big dreams. Upon landing a job at prestigious Runway magazine, she finds herself the assistant to diabolical editor Miranda Priestly. Andy questions her ability to survive her grim tour as Miranda's whipping girl without getting scorched.","Genre":{"Name":"Comedy","Description":"A comedy film is a film genre that emphasizes humor. These films are designed to amuse audiences and make them laugh. Films in this genre typically have a happy ending, with dark comedy being an exception to this rule."},"Director":{"Name":"Aline Brosh McKenna","Bio":"Aline Brosh McKenna is an American film producer, screenwriter, and director.","Birth":"1967"},"ImagePath":"prada.png","Featured":true}
